src/Documents/ПредоставлениеСвободногоОтРаботыДня.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПредоставлениеСвободногоОтРаботыДня</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостояниеРаботниковОрганизаций</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКадровогоПриказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВСоответствии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РаботникиОрганизации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеОрганизации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ознакомление</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СоставСемьи</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СоставСемьиДляСвободногоДня</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодПредоставленияСвобДня</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПериодПредоставленияСвободногоДня</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеоплачиваемыйДень</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/СостояниеРаботниковОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СостояниеРаботниковОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияРаботникаОрганизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеЗавершения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияРаботникаОрганизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СостоянияРаботникаОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияРаботникаОрганизации</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Работает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеРаботает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заболевание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Командировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускЕжегодный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускЕжегодныйЧасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускУчебный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускУчебныйНеоплачиваемый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускБезСохраненияЗарплатыСемейноБытовыеПричины</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускБезСохраненияЗарплатыУчебныеСборы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускПоБеременностиИРодам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускПоУходуЗаРебенком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтсутствуетПоНевыясненнойПричине</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВынужденныйПрогул</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосударственныеОбязанности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прогулы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеВыходныеДниОплачиваемые</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Простой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТравмаНаПроизводстве</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоУходуЗаРебенком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоУходуЗаВзрослым</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Карантин</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Протезирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеПриДолечивании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БольничныйПоБеременностиИРодам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопСвободныйДеньОтРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДеньДонора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СправкаПоУходуЗаРебенком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СвободныйДеньВНеделю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодСледствием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДетиДо16Лет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Медкомиссия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтбытиеНаказания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АлкогольноеНаркотическоеОпьянение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаботаВПраздничныеИВыходныеДни</Name>
					<Comment>Sway, Задача СВФР-002063</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеВыходныеДниБезОплаты</Name>
					<Comment>Sway, Задача СВФР-002063</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускПоКоллДоговору</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СвободныйОтРаботыДень</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускПоИнициативеНанимателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеСверхурочныеДни</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДеньДонораБезОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДеньОтдыхаЗаСверхрочные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ремонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоСреднемуЗаработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускПоСостояниюЗдоровья</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускСамоизоляция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтсутствиеПоИнициативеНанимателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоСреднемуЗаработкуСоревнования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрохождениеДиспансеризации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МедосмотрДляДонора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрохождениеМедосмотраИДонорство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДеньОтдыха</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обучение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочийНевыход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ПредоставлениеСвободногоОтРаботыДня/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	
	УчетВремениСвэй.УстановитьПоследнегоОтветственногоПоОбъекту(ЭтотОбъект);
	Если РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения Тогда 
		КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(РаботникиОрганизации, , "ФизЛицо");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УчетВремениСвэй.УстановитьПоследнееЗначениеСчетчика(ЭтотОбъект);

КонецПроцедуры // ПриЗаписи()

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураПечатныхФорм = Новый Структура;
	//СтруктураПечатныхФорм.Вставить("Макет",	"Печать К выдаче без аванса");	
	Возврат СтруктураПечатныхФорм;
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр СостояниеРаботниковОрганизаций
	Движения.СостояниеРаботниковОрганизаций.Записывать = Истина;
	Движения.СостояниеРаботниковОрганизаций.Очистить();
	Для Каждого ТекСтрокаРаботникиОрганизации Из РаботникиОрганизации Цикл
				
		Причина = Перечисления.СостоянияРаботникаОрганизации.СвободныйОтРаботыДень;
		
		// движения по дате "с"
		Движение = Движения.СостояниеРаботниковОрганизаций.Добавить();
		
		// Свойства
		Движение.Период			= НачалоДня(ТекСтрокаРаботникиОрганизации.Дата);
		
		// Измерения
		Движение.Сотрудник		= ТекСтрокаРаботникиОрганизации.Сотрудник;
		Движение.Организация	= Организация;
		
		// Ресурсы
		// здесь принято следующее соглашение - на каждую причину отсутствия обязательно есть одноименное состояние работника
		Движение.Состояние = Перечисления.СостоянияРаботникаОрганизации[Причина.Метаданные().ЗначенияПеречисления[Перечисления[Причина.Метаданные().Имя].Индекс(Причина)].Имя];
		
		Движение.ПериодЗавершения = НачалоДня(ТекСтрокаРаботникиОрганизации.Дата) + 86400;
			// Ресурсы
		Движение.СостояниеЗавершения = Перечисления.СостоянияРаботникаОрганизации.Работает;
			
						
		
		
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
	
	
КонецПроцедуры
